app/controllers/marks_controller.rb

SELECT "marks".* FROM "marks"
---
  def index
    @marks = Mark.all

INSERT INTO "marks" ("student_id", "m1", "m2", "m3", "m4", "m5", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["student_id", 101], ["m1", 77], ["m2", 88], ["m3", 84], ["m4", 72], ["m5", 70], ["created_at", "2022-11-26 16:46:04.161925"], ["updated_at", "2022-11-26 16:46:04.161925"]]
---
  def create
    @mark = Mark.new(mark_params)

    respond_to do |format|
      if @mark.save

DELETE FROM "marks" WHERE "marks"."id" = ?  [["id", 2]]
---
  def destroy
    @mark.destroy

SELECT "marks".* FROM "marks" WHERE "marks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_mark
      @mark = Mark.find(params[:id])