app/controllers/rank_controller.rb

    def rank
        @marks=Mark.limit(2)
---
SELECT "marks".* FROM "marks"