app/controllers/students_controller.rb

INSERT INTO "students" ("student_id", "name", "age", "address", "phone", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save